/*
 * @Author: yuyang
 * @Date: 2021-09-12 09:53:33
 * @LastEditTime: 2021-09-12 16:51:43
 * @LastEditors: yuyang
 */
import type { TabType } from '@/components/NewsList';

export const tabs1: TabType[] = [
  {
    tabKey: 'careerCoach',
    tabTitle: '生涯辅导（咨询类）专栏',
    newsList: [
      {
        id: '37',
        title: '《光明区高级中学+生涯辅导（咨询）类+一名高中生职业生涯规划咨询案例》',
      },
      {
        id: '38',
        title: '《罗湖高级中学 生涯辅导（咨询）案例 抑郁症复学学生的焦虑缓解及生涯辅导》',
      },
      {
        id: '39',
        title: '《深圳明德实验学校 生涯辅导(咨询)案例 高中生本科申请留学和专业的选择以及 职业规划探索》',
      },
      {
        id: '40',
        title: '《深圳市观澜中学 刘琳 生涯辅导(咨询)案例《我该怎么选？——高一分班选科生 涯咨询案例》》',
      },
      {
        id: '41',
        title: '《西乡中学 学生新高考选科的辅导案例》',
      },
    ],
  },
];

export const tabs2: TabType[] = [
  {
    tabKey: 'themeDesign',
    tabTitle: '主题课程设计类专栏',
    newsList: [
      {
        id: '42',
        title: '《龙岗区-陈静雯 华中师大龙岗附中 主题课程 探秘我的家庭资源》',
      },
      {
        id: '43',
        title: '《深圳市福田中学+主题课程设计案例+《如果上帝是个骰子》高一年级生涯觉醒课 程》',
      },
      {
        id: '44',
        title: '《坪山高级中学-主题课程设计案例-职业告白三部曲》',
      },
      {
        id: '45',
        title: '《深圳市观澜中学 刘琳 主题课程设计案例 《乾坤未定，你我皆是黑马》》',
      },
      {
        id: '46',
        title: '《深圳外国语学校龙华高中部+主题课程设计案例+人生处处有选择——我的价值观》',
      },
      {
        id: '47',
        title: '《深圳中学+主题课程设计案例+关于提升自控力，你必须知道的》',
      },
      {
        id: '48',
        title: '《省生涯案例征集 深圳华侨城中学 李小玲 我的生命鱼骨图》',
      },
      {
        id: '49',
        title: '《深圳第二外国语学校+主题课程设计类+大学专业知多少》',
      },
      {
        id: '50',
        title: '《深圳第二外国语学校+主题课程设计类+曲线中见成长》',
      },
      {
        id: '51',
        title: '《深圳第二外国语学校+主题课程设计类+时空穿梭的人生',
      },
    ],
  },
];

export const tabs3: TabType[] = [
  {
    tabKey: 'k1',
    tabTitle: '学科渗透生涯支持（学科融合）',
    newsList: [
      {
        id: '52',
        title: '《学案-高中地理融合生涯教育-以 《水循环》为例》',
      },
    ],
  },
  {
    tabKey: 'k2',
    tabTitle: '生涯活动案例库',
    newsList: [
      {
        id: '53',
        title: '《红岭中学+专题活动类+走出校园扩视野 成长至上-红岭中学暑期社会实践》',
      },
      {
        id: '54',
        title: '《龙岗区-华中师范大学龙岗附属中学-专题活动类》',
      },
      {
        id: '55',
        title: '《一面之缘 探索自我---梅林中学模拟面试活动方案》',
      },
      {
        id: '56',
        title: '《坪山高级中学-专题活动设计案例-“生涯杯”演讲比赛与相关培训》',
      },
      {
        id: '57',
        title: '《深圳第二外国语学校+专题活动设计类+高中生生涯规划大赛》',
      },
      {
        id: '58',
        title: '《深圳市龙华中学+主题班会+拼的是现在，比的是将来》',
      },
      {
        id: '59',
        title: '《深圳中学+专题活动设计案例+生涯探索星际之旅》',
      },
      {
        id: '60',
        title: '《育才中学专题活动设计案列《遇见未来的自己》职业生涯专业探索》',
      },
    ],
  },
  {
    tabKey: 'k3',
    tabTitle: '生涯教育基础知识',
    newsList: [
      {
        id: '61',
        title: '《何为生涯规划》',
      },
      {
        id: '62',
        title: '《生涯规划 的三个元素》',
      },
    ],
  },
];
