/*
 * @Author: yuyang
 * @Date: 2021-09-12 09:53:33
 * @LastEditTime: 2021-09-18 14:06:49
 * @LastEditors: yuyang
 */
import type { TabType } from '@/components/NewsList';

export const tabs1: TabType[] = [
  {
    tabKey: 'notice',
    tabTitle: '近期活动',
    newsList: [
      {
        id: '1',
        title: '港中大（深圳）邀请行业大咖为学生提供生涯规划指导',
      },
      {
        id: '2',
        title: '大师讲堂 | 文学、文学研究及其文化价值',
      },
      {
        id: '3',
        title: '生涯教育 | 同行成长——我校开展生涯教育全员培训活动',
      },
      {
        id: '4',
        title: '初中部应邀参加首届海峡两岸中学生涯教育高峰论坛',
      },
      {
        id: '5',
        title: '关于2015级高一新生生涯教育团体培训活动及第十二届学长团培训的招标结果',
      },
      {
        id: '6',
        title: '关于2015级高一新生生涯教育团体培训活动及第十二届学长团培训的招标公示',
      },
    ],
  },
  {
    tabKey: 'none',
    tabTitle: '',
    newsList: [
    ],
  },
];

export const tabs2: TabType[] = [
  {
    tabKey: 'policyDocument',
    tabTitle: '社会实践',
    newsList: [
      {
        id: '13',
        title: '关于2021年6月高一社会实践周活动采购服务项目的变更公告',
      },
      {
        id: '14',
        title: '2021年1月高二年级社会实践周活动采购服务项目招标公告',
      },
      {
        id: '15',
        title: '红岭教育集团石厦初中部2019年秋季初二年级学生社会实践活动',
      },
      {
        id: '16',
        title: '第26届寒假社会实践与社区服务总结（高中部）',
      },
      {
        id: '17',
        title: '社会实践中心成立暨首届公益文化周活动启动',
      },
      {
        id: '18',
        title: '2016年香港中文大学（深圳）暑期社会调查实践项目启动',
      },
    ],
  },
  {
    tabKey: 'none',
    tabTitle: '',
    newsList: [
    ],
  },

];

export const tabs3: TabType[] = [
  {
    tabKey: '',
    tabTitle: '高考咨询类',
    newsList: [
      {
        id: '25',
        title: '我省2021年夏季普通高校招生录取工作顺利结束',
        date: '2021-08-15',
      },
      {
        id: '26',
        title: '我省2021年普通高考专科批次第二次征集志愿正式投档',
        date: '2021-08-13',
      },
      {
        id: '27',
        title: '2021年夏季高考考试招生系列用书开始征订啦',
        date: '2021-08-11',
      },
      {
        id: '28',
        title: '欢迎报考广东云浮中医药职业学院！一起传承歧黄薪火！',
        date: '2021-08-11',
      },
      {
        id: '29',
        title: '关于做好广东省2021年专科批次院校第二次征集志愿和网上录取工作的通知',
        date: '2021-08-11',
      },
      {
        id: '30',
        title: '广东省2021年专科批次院校11日16:00开始第二次征集志愿',
        date: '2021-08-10',
      },
      {
        id: '31',
        title: '关于2021年全国部分普通高等学校在我省校考考点组织艺术类专业校考的通知',
        date: '2021-08-10',
      },
      {
        id: '32',
        title: '我省2021年普通高考提前批专科卫生专项计划及专科批次征集志愿正式投档',
        date: '2021-08-09',
      },
      {
        id: '33',
        title: '关于做好广东省2021年提前批专科卫生专项计划及专科批次院校征集志愿和网上录取工作的通知',
        date: '2021-08-06',
      },
      {
        id: '34',
        title: '我省本科批次录取圆满结束！29日开始提前批专科和专科批次院校投档录取工作',
        date: '2021-08-05',
      },
      {
        id: '35',
        title: '我省2021年普通高考专科批次普通类正式投档',
        date: '2021-08-03',
      },
      {
        id: '36',
        title: '学生高考文化总成绩是如何组成的？',
        date: '2021-08-02',
      },
    ],
  },
];
