/*
 * @Author: yuyang
 * @Date: 2021-09-12 09:53:33
 * @LastEditTime: 2021-09-17 11:15:37
 * @LastEditors: yuyang
 */
import type { TabType } from '@/components/NewsList';

export const tabs1: TabType[] = [
  {
    tabKey: 'notice',
    tabTitle: '公告公示',
    newsList: [
      {
        id: '1',
        title: '教育部等六部门关于加强新时代高校教师队伍建设改革的指导意见',
      },
      {
        id: '2',
        title: '国务院办公厅关于加快医学教育创新发展的指导意见',
      },
      {
        id: '3',
        title: '教育部 国家发展改革委 财政部关于加快新时代研究生教育改革发展的意见',
      },
      {
        id: '4',
        title: '深圳市教育局关于公布2020年中小学生艺术展演班级合唱及戏剧节活动获...',
      },
      {
        id: '5',
        title: '深圳市教育局 深圳市卫生健康委员会关于开展中小学生脊柱侧弯筛查的通..',
      },
      {
        id: '6',
        title: '深圳市教育局关于开展2020年深圳市中小学生羽毛球比赛的通知',
      },
    ],
  },
];

export const tabs2: TabType[] = [
  {
    tabKey: 'policyDocument',
    tabTitle: '政策文件',
    newsList: [
      {
        id: '13',
        title: '青岛：中小学生涯教育有了课时保障',
      },
      {
        id: '14',
        title: '上海交通大学努力打造学生生涯教育精品课程',
      },
      {
        id: '15',
        title: '上海交通大学“三大平台”构建学生生涯教育实践长效机制',
      },
      {
        id: '16',
        title: '重庆大学积极探索拔尖人才生涯教育模式',
      },
      {
        id: '17',
        title: '加强高中阶段教育学生生涯指导',
      },
      {
        id: '18',
        title: '909万高校毕业生，如何走好就业第一步',
      },
    ],
  },
  {
    tabKey: 'policyInterpretation',
    tabTitle: '政策解读',
    newsList: [
      {
        id: '19',
        title: '对《美国高等教育行动计划》的解读',
      },
      {
        id: '20',
        title: '专家解读：推动职教高质量发展 重在强化类型特色',
      },
      {
        id: '21',
        title: '专家解读《关于进一步减轻义务教育阶段学生作业负担和校外培训负担的意见》',
      },
      {
        id: '22',
        title: '教育收费政策解读',
      },
      {
        id: '23',
        title: '教育部办公厅关于印发《教育部基础教育教学指导委员会章程》的通知',
      },
      {
        id: '24',
        title: '推动省级人民政府切实履行教育职责',
      },
    ],
  },

];

export const tabs3: TabType[] = [
  {
    tabKey: '',
    tabTitle: '高考咨询类',
    newsList: [
      {
        id: '25',
        title: '我省2021年夏季普通高校招生录取工作顺利结束',
        date: '2021-08-15',
      },
      {
        id: '26',
        title: '我省2021年普通高考专科批次第二次征集志愿正式投档',
        date: '2021-08-13',
      },
      {
        id: '27',
        title: '2021年夏季高考考试招生系列用书开始征订啦',
        date: '2021-08-11',
      },
      {
        id: '28',
        title: '欢迎报考广东云浮中医药职业学院！一起传承歧黄薪火！',
        date: '2021-08-11',
      },
      {
        id: '29',
        title: '关于做好广东省2021年专科批次院校第二次征集志愿和网上录取工作的通知',
        date: '2021-08-11',
      },
      {
        id: '30',
        title: '广东省2021年专科批次院校11日16:00开始第二次征集志愿',
        date: '2021-08-10',
      },
      {
        id: '31',
        title: '关于2021年全国部分普通高等学校在我省校考考点组织艺术类专业校考的通知',
        date: '2021-08-10',
      },
      {
        id: '32',
        title: '我省2021年普通高考提前批专科卫生专项计划及专科批次征集志愿正式投档',
        date: '2021-08-09',
      },
      {
        id: '33',
        title: '关于做好广东省2021年提前批专科卫生专项计划及专科批次院校征集志愿和网上录取工作的通知',
        date: '2021-08-06',
      },
      {
        id: '34',
        title: '我省本科批次录取圆满结束！29日开始提前批专科和专科批次院校投档录取工作',
        date: '2021-08-05',
      },
      {
        id: '35',
        title: '我省2021年普通高考专科批次普通类正式投档',
        date: '2021-08-03',
      },
      {
        id: '36',
        title: '学生高考文化总成绩是如何组成的？',
        date: '2021-08-02',
      },
    ],
  },
];
